Repository: liuyi92/ukui-kwin
Catalog: po/*/kcm-kwin-scripts.po
Languages: pl, sv

# NAME OF TRANSLATORS
source: Your names
pl: Łukasz Wojniłowicz
sv: Stefan Asserhäll

# EMAIL OF TRANSLATORS
source: Your emails
pl: lukasz.wojnilowicz@gmail.com
sv: stefan.asserhall@bredband.net

source: KWin Scripts
pl: Skrypty KWin
sv: Kwin-skript

source: Configure KWin scripts
pl: Ustawienia skryptów KWin
sv: Anpassa Kwin-skript

source: Import KWin Script
pl: Importuj skrypt KWin
sv: Importera Kwin-skript

source: *.kwinscript|KWin scripts (*.kwinscript)
pl: *.kwinscript|Skrypty KWin (*.kwinscript)
sv: *.kwinscript|Kwin-skript (*.kwinscript)

# Placeholder is error message returned from the install service
source: Cannot import selected script. %1
pl: Nie można zaimportować wybranego skryptu. %1
sv: Kan inte importera valt skript. %1

# Placeholder is name of the script that was imported
source: The script "%1" was successfully imported.
pl: Skrypt "%1" został pomyślnie zaimportowany.
sv: Skriptet "%1" importerades med lyckat resultat.

source: KWin script configuration
pl: Ustawienia skryptu KWin
sv: Inställning av Kwin-skript

source: Install from File...
pl: Wgraj z pliku...
sv: Installera från fil...

source: Get New Scripts...
pl: Pobierz nowe skrypty...
sv: Hämta nya skript...
