Repository: liuyi92/ukui-kwin
Catalog: po/*/kwin_scripting.po
Languages: da, eu, fr, gl, id, it, ko, nb, nds, nl, pl, pt, pt_br, sk, sl, sv, uk

# NAME OF TRANSLATORS
source: Your names
da: Martin Schlander
eu: Iñigo Salvador Azurmendi
fr: Joëlle Cornavin
gl: Marce Villarino
id: Wantoyo
it: Nicola Ruggero
ko: 박신조
nb: Bjørn Steensrud
nds: Sönke Dibbern
nl: Freek de Kruijf
pl: Łukasz Wojniłowicz
pt: José Nuno Pires
pt_br: André Marcelo Alvarenga
sk: Roman Paholík
sl: Andrej Mernik
sv: Stefan Asserhäll
uk: Юрій Чорноіван

# EMAIL OF TRANSLATORS
source: Your emails
da: mschlander@opensuse.org
eu: xalba@euskalnet.net
fr: jcorn@free.fr
gl: mvillarino@kde-espana.org
id: wantoyek@gmail.com
it: nicola@nxnt.org
ko: kde@peremen.name
nb: bjornst@skogkatt.homelinux.org
nds: s_dibbern@web.de
nl: freekdekruijf@kde.nl
pl: lukasz.wojnilowicz@gmail.com
pt: zepires@gmail.com
pt_br: alvarenga@kde.org
sk: wizzardsk@gmail.com
sl: andrejm@ubuntu.si
sv: stefan.asserhall@bredband.net
uk: yurchor@ukr.net

# Error message
source: Plugin does not provide configuration file in expected location
da: Pluginet leverer ikke en konfigurationsfil på den forventede placering
eu: Pluginak ez du hornitu konfiguratzeko fitxategia esperotako kokalekuan
fr: Le module externe ne fournit pas de fichier de configuration à l'emplacement attendu
gl: O complemento non fornece un ficheiro de configuración no lugar que se agardaba
id: Plugin tidak menyediakan file konfigurasi di lokasi yang diharapkan
it: L'estensione non fornisce un file di configurazione nella posizione prevista
ko: 플러그인의 설정 파일이 예상한 위치에 없음
nb: Programtillegget skaffer ikke oppsettsfil på det forventede stedet
nds: Moduul hett keen Instellendatei an de verwachte Steed
nl: Plug-in levert geen configuratiebestand in de verwachte locatie
pl: Wtyczka nie dostarcza pliku konfiguracyjnego w oczekiwanym miejscu
pt: O 'plugin' não possui um ficheiro de configuração no local esperado
pt_br: O plugin não possui um arquivo de configuração no local esperado
sk: Plugin neposkytuje nastavenie v očakávanom umiestnení
sl: Vstavek ne ponuja nastavitvene datoteke na pričakovanem mestu
sv: Insticksprogrammet tillhandahåller inte en inställningsfil på förväntad plats
uk: Додатком не надано файла налаштувань за очікуваною адресою

# Assertion failed in KWin script with given value
source: Assertion failed: %1 is not null
da: Assertion mislykkedes: %1 er ikke null
eu: Baieztapenak huts egin du: %1 ez da nulua
fr: L'assertion a échoué : %1 n'est pas nul
gl: Fallou unha aserción: %1 non é nulo
id: Tuntutan gagal: %1 bukanlah nol
it: Assertion non riuscita: %1 non è nullo
ko: 가정 실패: %1이(가) null이 아님
nb: Påstand mislyktes: %1 er ikke null
nds: Besekern fehlslaan: %1 is nich Null
nl: Toekenning is mislukt: %1 is niet nul
pl: Nieudana asercja: %1 nie jest zerem
pt: O teste falhou: o %1 não é nulo
pt_br: O teste falhou: %1 não é nulo
sk: Kontrola zlyhala: %1 nie je null
sl: Uveljavljanje je spodletelo: %1 ni null
sv: Kontroll misslyckades: %1 är inte null
uk: Помилка під час перевірки умови: %1 не є порожнім

# Assertion failed in KWin script
source: Assertion failed: argument is null
da: Assertion mislykkedes: Argumentet er null
eu: Baieztapenak huts egin du: argumentua nulua da
fr: Échec de l'assertion : l'argument est nul
gl: Fallou unha aserción: o argumento é nulo
id: Tuntutan gagal: argumen nol
it: Assertion non riuscita: argomento nullo
ko: 가정 실패: 인자가 null임
nb: Påstand mislyktes: argument er null
nds: Besekern fehlslaan: Argument is Null
nl: Toekenning is mislukt: argument is nul
pl: Nieudana asercja: argument jest zerem
pt: O teste falhou: o argumento é nulo
pt_br: O teste falhou: argumento nulo
sk: Kontrola zlyhala: argument je null
sl: Uveljavljanje je spodletelo: argument je null
sv: Kontroll misslyckades: argumentet är null
uk: Помилка під час перевірки умови: аргумент є порожнім

# Error in KWin Script
source: Invalid number of arguments. At least service, path, interface and method need to be provided
da: Ugyldigt antal argumenter. Som mininum skal tjeneste, sti, grænseflade og metode angives
eu: Argumentu kopuru ezegokia. Gutxienez zerbitzua, bide-izena, interfazea eta metodoa hornitu behar dira
fr: Nombre incorrect d'arguments. Au moins un service, un emplacement, une interface et une méthode doivent être fournis
gl: Número incorrecto de argumentos. Deben fornecerse polo menos o servizo, a ruta, a interface e o método
id: Jumlah argumen tidak absah. Setidaknya layanan, alur, antarmuka dan metode harus diberikan
it: Numero di argomenti non valido. Devono essere specificati almeno il servizio, il percorso, l'interfaccia ed il metodo
ko: 인자 개수가 잘못됨. 최소한 service, path, interface, method를 지정해야 함
nb: Ugyldig antall argumenter. Det må minst oppgis tjeneste, sti. grensesnitt og metode.
nds: Leeg Argumententall. Tominnst Deenst, Padd, Koppelsteed un Metood mööt angeven wesen
nl: Ongeldige aantal argumenten. Service, pad, interface en methode moeten aangeleverd worden.
pl: Nieprawidłowa liczba argumentów. Muszą być podane co najmniej: usługa, ścieżka, interfejs i metoda
pt: O número de argumentos é inválido. É necessário indicar pelo menos o serviço, a localização, a interface e o método
pt_br: O número de argumentos é inválido. É necessário indicar pelo menos o serviço, a localização, a interface e o método
sk: Neplatný počet argumentov. Zadané musia byť aspoň služba, cesta, rozhranie a metóda
sl: Neveljavno število argumentov. Podati morate vsaj storitev, pot, vmesnik in metodo
sv: Ogiltigt antal argument. Åtminstone tjänst, sökväg, gränssnitt och metod måste anges
uk: Некоректна кількість параметрів. Слід надати принаймні запис служби, шляху, інтерфейсу та методу.

# Error in KWin Script
source: Invalid type. Service, path, interface and method need to be string values
da: Ugyldig type. Tjeneste, sti, grænseflade og metode skal være strengværdier
eu: Mota baliogabea. Zerbitzua, bide-izena, interfazea eta metodoa kate balioak izan behar dira
fr: Type incorrect. Un service, un emplacement, une interface et une méthode doivent être des valeurs de type chaînes de caractères
gl: Tipo incorrecto. Os valores do servizo, ruta, interface e método deben ser cadeas
id: Tipe tidak absah. Layanan, alur, alur dan metode harus nilai string
it: Tipo non valido. Il servizio, il percorso, l'interfaccia ed il metodo devono essere stringhe
ko: 형식이 잘못됨. service, path, interface, method는 문자열 값이어야 함
nb: Ugyldig type. Tjeneste, sti, grensesnitt og metode må være streng-verdier
nds: Leeg Typ. Deenst, Padd, Koppelsteed un Metood mööt Tekenkeden wesen
nl: Ongeldig type. Service, pad, interface en methode moeten tekenreeksen zijn
pl: Nieprawidłowy typ. Usługa, ścieżka, interfejs i metoda muszą być ciągami znaków
pt: O tipo é inválido. O serviço, a localização, a interface e o método deverão ser valores de texto
pt_br: O tipo é inválido. O serviço, a localização, a interface e o método devem ser valores de texto
sk: Neplatný typ. Služba, cesta, rozhranie a metóda musia byť reťazce
sl: Neveljavna vrsta. Storitev, pot, vmesnik in metoda morajo biti nizi
sv: Ogiltigt typ. Tjänst, sökväg, gränssnitt och metod måste vara strängvärden
uk: Некоректний тип. Записи служби, шляху, інтерфейсу та методу мають бути рядковими значеннями.

# syntax error in KWin script
source: Invalid number of arguments
da: Ugyldigt antal argumenter
eu: Argumentu kopuru ezegokia
fr: Nombre incorrect d'arguments
gl: Número incorrecto de argumentos
id: Jumlah argumen tidak absah
it: Numero di argomenti non valido
ko: 인자 개수가 잘못됨
nb: Ugyldig antall argumenter
nds: Leeg Tall vun Argumenten
nl: Ongeldige aantal argumenten
pl: Nieprawidłowa liczba argumentów
pt: Número de argumentos inválido
pt_br: Número de argumentos inválido
sk: Neplatný počet argumentov
sl: Neveljavno število argumentov
sv: Ogiltigt antal argument
uk: Некоректна кількість параметрів

# KWin Scripting function received incorrect value for an expected type
source: %1 is not a variant type
da: %1 er ikke en varianttype
eu: %1 ez da «variant» mota bat
fr: %1 n'est pas un type variant
gl: %1 non é un tipo de variante
id: %1 bukanlah tipe varian
it: %1 non è una variabile
ko: %1은(는) variant 형식이 아님
nb: %1 er ikke en variant-type
nds: %1 hett nich den Typ "Variant".
nl: %1 is niet van het type variabel
pl: %1 nie jest typem variant
pt: O %1 não é um tipo variante
pt_br: O %1 não é um tipo variante
sk: %1 nie je typu variant
sl: %1 ni vrsta različice
sv: %1 är inte en varianttyp
uk: %1 не належить до типу варіантів

# KWin Scripting function received incorrect value for an expected type
source: %1 is not of required type
da: %1 er ikke en påkrævet type
eu: %1 ez da beharrezkoa motakoa
fr: %1 n'est pas du type requis
gl: %1 non é do tipo requirido
id: %1 bukanlah tipe yang diperlukan
it: %1 non è del tipo richiesto
ko: %1이(가) 필요한 형식이 아님
nb: %1 er ikke av den typen som kreves
nds: %1 hett nich den nödigen Typ.
nl: %1 is niet van het vereiste type
pl: %1 nie jest wymaganym typem
pt: O %1 não é do tipo necessário
pt_br: O %1 não é do tipo necessário
sk: %1 nie je vyžadovaného typu
sl: %1 ni zahtevana vrsta
sv: %1 har inte nödvändig typ
uk: %1 не належить до потрібного типу

# KWin Scripting error thrown due to incorrect argument
source: Second argument to registerScreenEdge needs to be a callback
da: Det andet argument til registerScreenEdge skal være et callback
eu: registerScreenEdge-ren bigarren argumentua atzeradei bat izan behar da
fr: Le second argument à « registerScreenEdge » doit être un rappel
gl: O segundo argumento de registerScreenEdge debe ser unha función de callback
id: Argumen kedua untuk registerScreenEdge memerlukan panggilan balik
it: Il secondo argomento per registerScreenEdge deve essere una callback
ko: registerScreenEdge의 두 번째 인자는 callback이어야 함
nb: Det andre argumentet til registerScreenEdge må være et tilbakekall
nds: Tweet Argument för registerScreenEdge mutt en Torüchroop-Funkschoon wesen
nl: Tweede argument van registerScreenEdge moet van het type callback zijn
pl: Drugi argument do registerScreenEdge musi być oddzwanianiem
pt: O segundo argumento do 'registerScreenEdge' tem de ser uma função de retorno
pt_br: O segundo argumento do registerScreenEdge precisa ser uma função de retorno
sk: Druhý argument pre registerScreenEdge musí byť callback
sl: Drugi argument za registerScreenEdge mora biti povratni klic
sv: Andra argumentet till registerScreenEdge måste vara ett återanrop
uk: Другим аргументом registerScreenEdge має бути зворотний виклик

# KWin Scripting error thrown due to incorrect argument
source: Second argument to registerTouchScreenEdge needs to be a callback
da: Det andet argument til registerTouchScreenEdge skal være et callback
eu: registerTouchScreenEdge-ren bigarren argumentua atzeradei bat izan behar da
fr: Le second argument à « registerTouchScreenEdge » doit être un rappel
gl: O segundo argumento de registerTouchScreenEdge debe ser unha función de callback
id: Argumen kedua untuk registerTouchScreenEdge memerlukan panggilan balik
it: Il secondo argomento per registerTouchScreenEdge deve essere una callback
ko: registerTouchScreenEdge의 두 번째 인자는 callback이어야 함
nl: Tweede argument van registerTouchScreenEdge moet van het type callback zijn
pl: Drugi argument do registerTouchScreenEdge musi być oddzwanianiem
pt: O segundo argumento do 'registerTouchScreenEdge' tem de ser uma função de retorno
pt_br: O segundo argumento do registerTouchScreenEdge precisa ser uma função de retorno
sk: Druhý argument pre registerTouchScreenEdge musí byť callback
sl: Drugi argument za registerTouchScreenEdge mora biti povratni klic
sv: Andra argumentet till registerTouchScreenEdge måste vara ett återanrop
uk: Другим аргументом registerTouchScreenEdge має бути зворотний виклик

# KWin Scripting error thrown due to incorrect argument
source: Argument for registerUserActionsMenu needs to be a callback
da: Argumentet til registerUserActionsMenu skal være et callback
eu: registerUserActionsMenu-ren argumentua atzeradei bat izan behar da
fr: L'argument pour « registerUserActionsMenu » doit être un rappel
gl: O argumento de registerUserActionsMenu debe ser unha función de callback
id: Argumen registerUserActionsMenu memerlukan panggilan balik
it: L'argomento per registerUserActionsMenu deve essere una callback
ko: registerUserActionsMenu의 두 번째 인자는 callback이어야 함
nb: Argument til registerUserActionsMenu må være et tilbakekall
nds: Argument för registerUserActionsMenu mutt en Torüchroop-Funkschoon wesen
nl: Argument van registerUserActionsMenu moet van het type callback zijn
pl: Argument do registerUserActionsMenu musi być oddzwanianiem
pt: O argumento do 'registerUserActionsMenu' tem de ser uma função de retorno
pt_br: O argumento do registerUserActionsMenu precisa ser uma função de retorno
sk: Argument pre registerUserActionsMenu musí byť callback
sl: Argument za registerUserActionsMenu mora biti povratni klic
sv: Argumentet till registerUserActionsMenu måste vara återanrop
uk: Аргументом registerUserActionsMenu має бути зворотний виклик

# Assertion failed in KWin script with given value
source: Assertion failed: %1
da: Assertion mislykkedes: %1
eu: Baieztapenak huts egin du: %1
fr: L'assertion a échoué : %1
gl: Fallou unha aserción: %1
id: Tuntutan gagal: %1
it: Assertion non riuscita: %1
ko: 가정 실패: %1
nb: Påstand mislyktes: %1
nds: Besekern fehlslaan: %1
nl: Toekenning is mislukt: %1
pl: Nieudana asercja: %1
pt: O teste falhou: %1
pt_br: O teste falhou: %1
sk: Kontrola zlyhala: %1
sl: Uveljavljanje je spodletelo: %1
sv: Kontroll misslyckades: %1
uk: Помилка під час перевірки умови: %1

# Assertion failed in KWin script with expected value and actual value
source: Assertion failed: Expected %1, got %2
da: Assertion mislykkedes: Forventede %1, fik %2
eu: Baieztapenak huts egin du: %1 espero zen, %2 jaso da
fr: L'assertion a échoué : %1 était attendu, %2 a été obtenu
gl: Fallou unha aserción: Agardábase %1, pero obtívose %2
id: Tuntutan gagal: Diharapkan %1, mendapat %2
it: Assertion non riuscita: Atteso %1, ricevuto %2
ko: 가정 실패: %1을(를) 예상했지만 %2이(가) 옴
nb: Påstand mislyktes: forventet %1, fant %2
nds: Besekern fehlslaan: Verwacht %1, kregen %2
nl: Toekenning is mislukt: verwacht %1, gekregen %2
pl: Nieudana asercja: Oczekiwano %1, otrzymano %2
pt: O teste falhou: Esperava-se '%1', mas recebeu-se '%2'
pt_br: O teste falhou: Esperava-se %1, mas foi obtido %2
sk: Kontrola zlyhala: Očakáva sa %1, získané %2
sl: Uveljavljanje je spodletelo: pričakovano %1, dobljeno %2
sv: Kontroll misslyckades: Förväntade %1, hittade %2
uk: Помилка під час перевірки умови: очікувалося %1, отримано %2
